# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. 
# Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. 
# Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. 
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
#
vowels = 'уеаоэяию'
syllables = 0
ph = []
verse = input()
for ch in verse:
    if ch in vowels:
        syllables += 1
    if ch == ' ':
        ph.append(syllables)
        syllables = 0
ph.append(syllables)
if len(set(ph)) > 1:
    print('Пам парам')
else:
    print('Парам пам-пам')
